rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 23]]
UPDATE "movies" SET "title" = ?, "rating" = ?, "director" = ?, "release_date" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["title", "Aladdin 2"], ["rating", "NC-17"], ["director", "Ivan Fuentes"], ["release_date", "1987-02-07 00:00:00.000000"], ["updated_at", "2018-03-20 20:24:44.858829"], ["id", 1]]
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(movie_params)

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 21]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]
---
  def samedirector
    logger.debug "HERE"
    moviesDir = Movie.find params[:id]
    logger.debug(moviesDir.description)
    @movies = Movie.where(director: moviesDir.director)